#Область ОбработчикиСобытий		  
		  
Процедура ПередЗаписью(Отказ)
	
	Если Пациент.Пустая() Тогда
		ЗаполнитьПациента();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(КрайнийСрок) Тогда
		Отказ = Истина;
		ВызватьИсключение "Не заполнен крайний срок";
	КонецЕсли;	
	
	МЗ = РегистрыСведений.РеестрЗаявокНаМедосмотр.СоздатьМенеджерЗаписи();
	МЗ.ЗаявкаНаМедосмотр = Ссылка;
	МЗ.Пациент 			 = Пациент;
	
	МЗ.Прочитать();
	Если НЕ МЗ.Выбран() 
		ИЛИ (МЗ.ЗаключениеМедКомиссии.Пустая()
		И НЕ МЗ.Просрочена) Тогда
		
		МЗ.ЗаявкаНаМедосмотр = Ссылка;
		МЗ.Пациент 			 = Пациент;
		МЗ.ДатаЗаявки  = Дата;
		МЗ.КрайнийСрок = КрайнийСрок;
		МЗ.Записать();

	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции		  
		  
Процедура ЗаполнитьПациента()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пациенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пациенты КАК Пациенты
	|ГДЕ
	|	Пациенты.Фамилия = &Фамилия
	|	И Пациенты.Имя = &Имя
	|	И Пациенты.Отчество = &Отчество
	|	И Пациенты.ДатаРождения = &ДатаРождения";
	
	Запрос.УстановитьПараметр("Фамилия"     , Фамилия);
	Запрос.УстановитьПараметр("Имя"         , Имя);
	Запрос.УстановитьПараметр("Отчество"    , Отчество);
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НовыйПациент = Справочники.Пациенты.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйПациент, ЭтотОбъект);
		НовыйПациент.Записать();
		Пациент = НовыйПациент.Ссылка;
	Иначе	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Пациент = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
