
#Область ОбработчикиСобытий		  
		  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаМедосмотр") Тогда
		ЗаявкаНаМедосмотр = ДанныеЗаполнения;
		Пациент           = ДанныеЗаполнения.Пациент;
		ТипДопуска        = Перечисления.ТипыДопусковСотрудников.Допущен;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеестрЗаявок.ЗаявкаНаМедосмотр КАК ЗаявкаНаМедосмотр,
	|	РеестрЗаявок.Пациент КАК Пациент,
	|	РеестрЗаявок.ДатаЗаявки КАК ДатаЗаявки,
	|	РеестрЗаявок.КрайнийСрок КАК КрайнийСрок
	|ИЗ
	|	РегистрСведений.РеестрЗаявокНаМедосмотр КАК РеестрЗаявок
	|ГДЕ
	|	РеестрЗаявок.ЗаявкаНаМедосмотр = &ЗаявкаНаМедосмотр
	|	И РеестрЗаявок.Пациент = &Пациент";
	
	Запрос.УстановитьПараметр("ЗаявкаНаМедосмотр", ЗаявкаНаМедосмотр);
	Запрос.УстановитьПараметр("Пациент"          , Пациент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		МЗ = РегистрыСведений.РеестрЗаявокНаМедосмотр.СоздатьМенеджерЗаписи();
        ЗаполнитьЗначенияСвойств(МЗ, Выборка); 
		МЗ.ЗаключениеМедКомиссии = Ссылка;
		МЗ.Записать();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

