#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
    ЮТТесты.ДобавитьТест("ПроверкаПроведенияЗаявкиИЗаписиВРегистр" ,, "Позитив, Губер Ксения");
	ЮТТесты.ДобавитьТест("ПроверкаПроведенияЗаявкиБезКрайнегоСрока",, "Негатив, Губер Ксения");

КонецПроцедуры

Процедура ПроверкаПроведенияЗаявкиИЗаписиВРегистр() Экспорт
	
	Для НомерДокумента = 1 По 2 Цикл
		
		// 1. Создание объектов.
		ПациентНовый      = СозданиеПациента(НомерДокумента);
		ЗаявкаНаМедосмотр = СозданиеДокументаЗаявкаНаМедосмотр(ПациентНовый, НомерДокумента);
		
		// 2. Проверка проведения.
		ЮТест.ОжидаетЧто(ЗаявкаНаМедосмотр.ПолучитьОбъект())
			.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
			.НеВыбрасываетИсключение()	
			;
			
		// 3. Проверка наличия записи в регистре
		ОписаниеЗапросЗаявки = ЗапросПоРегиструЗаявок(ЗаявкаНаМедосмотр);
	    ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапросЗаявки)).ЭтоЛожь();
			
	КонецЦикла;		

КонецПроцедуры

Процедура ПроверкаПроведенияЗаявкиБезКрайнегоСрока() Экспорт
	
	Для НомерДокумента = 1 По 2 Цикл
		
		// 1. Создание объектов.
		ПациентНовый 	  = СозданиеПациента(НомерДокумента);
		ЗаявкаНаМедосмотр = СозданиеДокументаЗаявкаНаМедосмотр(ПациентНовый, НомерДокумента, Истина);
		
		// 2. Проверка невозможности проведения без заполненного крайнего срока.
		ЮТест.ОжидаетЧто(ЗаявкаНаМедосмотр.ПолучитьОбъект())
			.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
			.ВыбрасываетИсключение("Не заполнен крайний срок")	
			;
			
	КонецЦикла;		

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СозданиеПациента(НомерДокумента)
	
	КонструкторПациента = ЮТест.Данные().КонструкторОбъекта("Справочники.Пациенты")
		.ФикцияОбязательныхПолей()
		.Установить("ДатаРождения", ДобавитьМесяц(ТекущаяДатаСеанса(), -60 * НомерДокумента))
		;
		
    ПациентНовый = КонструкторПациента.Записать();
	
	ЮТест.ОжидаетЧто(ПациентНовый)
		.ИмеетТип("СправочникСсылка.Пациенты")
		.Свойство("Наименование").Заполнено()
		;
	
	Возврат ПациентНовый;

КонецФункции

Функция СозданиеДокументаЗаявкаНаМедосмотр(Пациент, НомерДокумента, ПустойКрайниСрок = Ложь)

	ЗаявкаНаМедосмотр = ЮТест.Данные().КонструкторОбъекта("Документы.ЗаявкаНаМедосмотр")
		.ФикцияОбязательныхПолей()
		.Установить("Пациент"    , Пациент)
		.Установить("КрайнийСрок", ?(ПустойКрайниСрок, Дата(1,1,1), ДобавитьМесяц(ТекущаяДатаСеанса(), НомерДокумента)))
		.Записать()	
		;
		
	ЮТест.ОжидаетЧто(ЗаявкаНаМедосмотр)
		.ИмеетТип("ДокументСсылка.ЗаявкаНаМедосмотр")
		;
	
	Возврат ЗаявкаНаМедосмотр;

КонецФункции

Функция ЗапросПоРегиструЗаявок(Заявка)

	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрСведений.РеестрЗаявокНаМедосмотр";
	ОписаниеЗапроса.Условия.Добавить("ЗаявкаНаМедосмотр = &ЗаявкаНаМедосмотр");
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("ЗаявкаНаМедосмотр");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("ЗаявкаНаМедосмотр", Заявка);
	Возврат ОписаниеЗапроса;
	
КонецФункции

#КонецОбласти
