#Область ОбработчикиСобытий	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаЗаявкиС  = ТекущаяДата();
	КрайнийСрокДо = ДобавитьМесяц(ТекущаяДата(), 2);
	
	ЗаполнитьЗначенияПараметров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ДатаЗаявкиСПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ДатаЗаявкиС) Тогда
		ДатаЗаявкиС = ТекущаяДата();
	КонецЕсли;
	
	ЗаполнитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура КрайнийСроДокПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(КрайнийСрокДо) Тогда
		КрайнийСрокДо = ДобавитьМесяц(ТекущаяДата(), 2);
	КонецЕсли;
	
	ЗаполнитьЗначенияПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтмененныеПриИзменении(Элемент)
	ЗаполнитьЗначенияПараметров();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОбработанныеЗаявкиПриИзменении(Элемент)
	ЗаполнитьЗначенияПараметров();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаМедосмотрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ЗаявкиНаМедосмотр.ТекущиеДанные;
	ИмяКолонки = Поле.Имя;
	
	Если ИмяКолонки = "ЗаключениеМедКомиссии" Тогда
		ТекущееЗаключение = ТекущиеДанные.ЗаключениеМедКомиссии; 
		Если НЕ ЗначениеЗаполнено(ТекущееЗаключение) Тогда
			СтруктураПараметров = Новый Структура("Основание", ТекущиеДанные.ЗаявкаНаМедосмотр);
			ОткрытьФорму("Документ.ЗаключениеМедицинскойКомиссии.Форма.ФормаДокумента", СтруктураПараметров, ЭтаФорма);
		Иначе
			ПоказатьЗначение(, ТекущееЗаключение);
		КонецЕсли;
	ИначеЕсли ИмяКолонки = "Пациент"
		ИЛИ ИмяКолонки = "ЗаявкаНаМедосмотр" Тогда
		ПоказатьЗначение(, ТекущиеДанные[ИмяКолонки]);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаМедосмотрПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаМедосмотрПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияПараметров()
	
	ЗаявкиНаМедосмотр.Параметры.УстановитьЗначениеПараметра("Просрочена" , ПоказатьПросроченные);
	ЗаявкиНаМедосмотр.Параметры.УстановитьЗначениеПараметра("ДатаЗаявки" , ДатаЗаявкиС);
	ЗаявкиНаМедосмотр.Параметры.УстановитьЗначениеПараметра("КрайнийСрок", КрайнийСрокДо);
	ЗаявкиНаМедосмотр.Параметры.УстановитьЗначениеПараметра("СкрытьОбработанныеЗаявки", СкрытьОбработанныеЗаявки);
	
КонецПроцедуры	



#КонецОбласти





