#Область МедОсмотры

Процедура ЗакрытиеНевыполненныхЗаявокНаМедосмотр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеестрЗаявок.ЗаявкаНаМедосмотр КАК ЗаявкаНаМедосмотр,
	|	РеестрЗаявок.Пациент КАК Пациент
	|ИЗ
	|	РегистрСведений.РеестрЗаявокНаМедосмотр КАК РеестрЗаявок
	|ГДЕ
	|	РеестрЗаявок.Просрочена = ЛОЖЬ
	|	И РеестрЗаявок.ЗаключениеМедКомиссии = ЗНАЧЕНИЕ(Документ.ЗаключениеМедицинскойКомиссии.ПустаяСсылка)
	|	И РеестрЗаявок.КрайнийСрок < &КрайнийСрок";
	
	Запрос.УстановитьПараметр("КрайнийСрок", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МЗ = РегистрыСведений.РеестрЗаявокНаМедосмотр.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				МЗ.Просрочена = Истина;
				МЗ.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


