#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ИндексНаименования = ПроверяемыеРеквизиты.Найти("Наименование");
	Если ИндексНаименования <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ИндексНаименования);
	КонецЕсли;	
КонецПроцедуры
 
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	СформироватьНаименование();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьНаименование()
	
	Наименование = СтрШаблон("%1 %2 %3, %4", Фамилия, Имя, Отчество, Формат(ДатаРождения, "ДЛФ=D"));
	Наименование = СтрЗаменить(Наименование, "  ", "");
	
КонецПроцедуры


#КонецОбласти
