#Область ОбработчикиСобытийФормы   
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Объект.ЗаявкаНаМедосмотр) Тогда
		Сообщить("Заключение мед. комиссии создается только на основании документа ""Заявка на мед. осмотр""");
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПечатьЗаключения(Команда)
	ПечатьЗаключенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаключенияНаСервере()
	
КонецПроцедуры

#КонецОбласти
